# ==========================================
# โจทย์ข้อที่ 4: คำนวณราคาสินค้าหลังหักส่วนลด
# Input: ราคาสินค้ารวม (จำนวนเต็ม)
# Output: ราคาสุทธิที่ต้องชำระ
# เงื่อนไข: ยอดตั้งแต่ 2,000 บาท ลด 200 บาท | ยอดตั้งแต่ 1,000 บาท ลด 100 บาท | น้อยกว่า 1,000 บาท ไม่ได้รับส่วนลด
# ==========================================


# นักเรียนเขียนโค้ดต่อจากบรรทัดนี้
price = int(input("ราคาสินค้ารวม: "))

total:
if price >= 2000
print price-200
elif price >= 1000
print price-100
else:
print("ไม่ได้รับส่วนลด")

print(f("ราคาสุทธิที่ต้องชำระ {total:.2f}บาท"))
